PWS/HWs/Project/BookStoreComposite/src/jbiasa/BookStoreComposite.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<!--
  This file is auto-generated by CASA. 
  Edit its content manually may cause unrecoverable errors.
-->

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             targetNamespace="BookStoreComposite"
             xmlns:tns="BookStoreComposite" xmlns:ns="http://j2ee.netbeans.org/wsdl/BookStoreBPEL2/ClientComposite" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:ns1="http://authorization/">
    <import namespace="http://j2ee.netbeans.org/wsdl/BookStoreBPEL2/ClientComposite" location="../jbiServiceUnits/BookStoreBPEL2/ClientComposite.wsdl"/>
    <import namespace="http://authorization/" location="../jbiServiceUnits/META-INF/BookStoreBPEL2/src/_references/_projects/BookStore2/src/conf/wsdl/AuthorizationWSService.wsdl"/>
    <portType name="dummyCasaPortType"/>
    <binding name="casaBinding1" type="ns:ClientCompositePortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="ClientCompositeOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="BookStoreComposite"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="BookStoreComposite"/>
            </output>
        </operation>
    </binding>
    <binding name="casaBinding2" type="ns1:AuthorizationWS">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="login">
            <soap:operation/>
            <input>
                <soap:body use="literal"/>
            </input>
            <output>
                <soap:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="BookStoreCompositeService1">
        <port name="casaPort1" binding="tns:casaBinding1">
            <soap:address location="http://localhost:11893/BookStoreCompositeService1/casaPort1"/>
        </port>
    </service>
    <service name="BookStoreCompositeService2">
        <port name="Authorization" binding="tns:casaBinding2">
            <soap:address location="http://localhost:11983/BookStore2/AuthorizationWSService"/>
        </port>
    </service>
</definitions>



